ENPH253/arduino-tinah/boards.txt
# Menu options
menu.opt=Optimization
menu.pinout=Pinout

#####################
####### TINAH #######
#####################

TINAH.name=TINAH Board
TINAH.upload.tool=avrdude
TINAH.upload.protocol=wiring
TINAH.upload.maximum_size=126976
TINAH.upload.speed=115200

TINAH.bootloader.tool=avrdude
TINAH.bootloader.unlock_bits=0x3f
TINAH.bootloader.lock_bits=0x0f
TINAH.bootloader.low_fuses=0xFF
TINAH.bootloader.high_fuses=0xDA

TINAH.build.core=MCUdude_corefiles
TINAH.build.variant=TINAHvariant
TINAH.build.mcu=atmega128
TINAH.build.board=AVR_TINAH
TINAH.build.f_cpu=16000000L

TINAH.ltoarcmd=avr-gcc-ar

#-- Optimizations
TINAH.menu.opt.osstd=Smallest (default)
TINAH.menu.opt.osstd.build.flags.optimize=-Os
TINAH.menu.opt.osstd.build.flags.ldspecs=
TINAH.menu.opt.oslto=Smallest with LTO
TINAH.menu.opt.oslto.build.flags.optimize=-Os -flto
TINAH.menu.opt.oslto.build.flags.ldspecs=-flto
TINAH.menu.opt.o0std=None (-O0)
TINAH.menu.opt.o0std.build.flags.optimize=-O0
TINAH.menu.opt.o0std.build.flags.ldspecs=
TINAH.menu.opt.o0lto=None (-O0) with LTO
TINAH.menu.opt.o0lto.build.flags.optimize=-O0 -flto
TINAH.menu.opt.o0lto.build.flags.ldspecs=-flto
TINAH.menu.opt.o1std=Fast (-O1)
TINAH.menu.opt.o1std.build.flags.optimize=-O1
TINAH.menu.opt.o1std.build.flags.ldspecs=
TINAH.menu.opt.o1lto=Fast (-O1) with LTO
TINAH.menu.opt.o1lto.build.flags.optimize=-O1 -flto
TINAH.menu.opt.o1lto.build.flags.ldspecs=-flto
TINAH.menu.opt.o2std=Faster (-O2)
TINAH.menu.opt.o2std.build.flags.optimize=-O2
TINAH.menu.opt.o2std.build.flags.ldspecs=
TINAH.menu.opt.o2lto=Faster (-O2) with LTO
TINAH.menu.opt.o2lto.build.flags.optimize=-O2 -flto
TINAH.menu.opt.o2lto.build.flags.ldspecs=-flto
TINAH.menu.opt.o3std=Fastest (-O3)
TINAH.menu.opt.o3std.build.flags.optimize=-O3
TINAH.menu.opt.o3std.build.flags.ldspecs=
TINAH.menu.opt.o3lto=Fastest (-O3) with LTO
TINAH.menu.opt.o3lto.build.flags.optimize=-O3 -flto
TINAH.menu.opt.o3lto.build.flags.ldspecs=-flto
TINAH.menu.opt.ogstd=Debug (-g)
TINAH.menu.opt.ogstd.build.flags.optimize=-Og
TINAH.menu.opt.ogstd.build.flags.ldspecs=
